In [103]:
import pandas as pd
import matplotlib.pyplot as plt

In [155]:
pd.options.display.max_rows=1000

In [188]:
accounts = pd.read_csv('account_dat.csv')
apps=pd.read_csv('app_dat.csv')
in_app_cont=pd.read_csv('in-app_dat.csv')
devices=pd.read_csv('device_ref.csv')
categories=pd.read_csv('category_ref.csv')
trans=pd.read_csv('transaction_dat.csv')

accounts.create_dt = pd.to_datetime(accounts.create_dt)
# accounts['year_month'] = pd.to_datetime(accounts.create_dt).dt.to_period('M')
# accounts['year'] = pd.to_datetime(accounts.create_dt).dt.year

In [ ]:
print(accounts.isnull().sum())
print(trans.isnull().sum())

In [196]:
print(accounts.shape)
accounts.head()

(100000, 3)

            acct_id  create_dt payment_type
0  eb23e449d274bddb 2012-04-03         PMOF
1  3d60dcb8494a0d70 2009-08-31         PMOF
2  9b6d6fbf76504d85 2008-11-06         PMOF
3  343255370828b380 2012-01-03         PMOF
4  664e27f05189c387 2010-10-31         PMOF

In [195]:
print(trans.shape)
trans.head()

(3607509, 5)

    create_dt        content_id           acct_id  price  device_id
0  2016-08-28  b6cf4f33e7455df4  220574a7a6a71afa  11.99          1
1  2016-09-16  71ac3e9c38ddbbba  8551f69a5015ea6a   1.99          2
2  2016-08-15  776b851b916c33d1  7dedf309494a1966   0.99          2
3  2016-06-17  7a47ca132a8dc695  7174a81c796dcf7e   1.99          2
4  2016-06-13  30581219bc952dbb  35aaf59d64a677e7  11.99          2

In [192]:
print(in_app_cont.shape)
in_app_cont.head()

(2376, 3)

  parent_app_content_id        content_id        type
0      d2bde35599e0dae9  227227a77c59809b  consumable
1      d2bde35599e0dae9  41ac2362a2600185  consumable
2      d2bde35599e0dae9  64a8e16f030bb611  consumable
3      d2bde35599e0dae9  2c8ba424183afa7c  consumable
4      d2bde35599e0dae9  b4c42fa5cc420f7b  consumable

In [193]:
categories

       category_name category_id
0              Games         Z-1
1  Social Networking         Q-5
2          Utilities         M-7
3      Entertainment         Q-1
4    Photos & Videos         Y-8

In [197]:
devices

  device_name  device_id
0      iPhone          1
1        iPad          2
2        Both          3

In [199]:
print(apps.shape)
apps.head()

(1000, 4)

               app_name        content_id category_id  device_id
0  half-slouched having  22dfac9721b899cb         Y-8          3
1      lift whale-ships  7c645810cd7f166e         M-7          3
2    mightily community  c495bcb878faffaa         Y-8          2
3   session: too--shall  4e683dcd461cdd22         Y-8          1
4          That Zoology  6473dd29a2badbf1         Y-8          3